---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightInfo.Dispose
source: html/244b81d0-1385-c16b-3041-32d7883ecd6f.htm
---
# Autodesk.Revit.DB.ExportLineweightInfo.Dispose Method

Releases all resources used by the ExportLineweightInfo

## Syntax (C#)
```csharp
public void Dispose()
```